# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 classification model
# CFG file for YOLOv12-cls

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-cls.yaml' will call yolov12-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 283 layers, 1,772,976 parameters, 1,772,976 gradients, 3.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 283 layers, 6,051,088 parameters, 6,051,088 gradients, 11.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 319 layers, 11,555,728 parameters, 11,555,728 gradients, 36.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 581 layers, 14,561,680 parameters, 14,561,680 gradients, 48.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 581 layers, 32,010,544 parameters, 32,010,544 gradients, 107.4 GFLOPs


# YOLO12-cls backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 1]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-cls head
head:
  - [-1, 1, Classify, [nc]] # Classify
